package myprogect;

public class PublicTransport {
	boolean nextTransport;
	Time time;
	
	public static void main(String[] args){
		Route route = new Route(new Trip());
		Time time = new Time(new Bus());
		route.trip.setAdressFrom("trabe");
		route.trip.setAdressTo("berwood");
		route.findRoute();
		time.findTime();
	}
	/*	1. Отримати нагадування на "девайс" про те, що потрібно виходити
	для "користувача", який здійснив пошук "маршруту":	
		Підтвердити або ввести приблизний час, що потрібний, щоб дійти до зупинки
		Ввести час, на який користувачу потрібно добратись в кінцевий пункт призначення або вибрати пункт - найближчий транспорт
	
	для користувача, який запланував поїздку:
		Підтвердити або ввести приблизний "час", що потрібний, щоб дійти до "зупинки"

	2. Подивитись через скільки часу транспорт буде на зупинці
		для користувача, який знає на якому транспорті буде їхати:
	Вибрати транспорт
	Система визначає місце найближчої зупинки за рахунок місцезнаходження користувача
	Система виводить час, через який транспорт буде на зупинці
	для користувача, який здійснив пошук:
	Система виводить час, через який транспорт буде на зупинці

	3. Пошук маршруту
	Вибрати на карті початковий пункт
	Вибрати на карті пункт призначення
	Прокласти маршрут

	4. Отримати нагадування, яке повідомляє коли потрібно вийти, щоб здійснити пересадку на інший транспорт
		для користувача, який здійснив пошук маршруту:
	Визначити місце пересадки

	5. Подивитись маршрут транспорту 
	Вибрати номер транспорту
	Подивитись розклад руху маршруту
	Візуально відстежити транспорт в реальному часі

	6. Запланувати поїздки на день/тиждень/місяць
	Визначити час поїздки
	Встановити регулярність поїздок
	Вибрати адреси(у) місць(я) призначення у відповідній до поїздок послідовності

	7. Синхронізація з Google календарем
	Вибрати синхронізацію
	Ввести логін та пароль акаунту Google (якщо не в системі)
	Виділити заплановану(і) подію(ї)
	Вказати адресу(и), де буде(уть) проходити подія(ї)
	  

*/
	

}
